type LevelKey = "emotionLevel" | "identityLevel" | "socialLevel" | "functionLevel"

interface Question {
    id: number
    text: string
}

interface Dimension {
    id: LevelKey
    title: string
    description: string
    questions: Question[]
}

interface Test {
    scale: string[]
    dimensions: Dimension[]
}

export const Test: Test = {
    "scale": ["Ніколи", "Рідко", "Інколи", "Часто", "Майже завжди"],
    "dimensions": [
        {
            "id": "emotionLevel",
            "title": "Емоційний стан",
            "description": "Депресивність, тривога, стрес, емоційне виснаження.",
            "questions": [
                { "id": 1, "text": "Я часто відчуваю пригнічений настрій." },
                { "id": 2, "text": "Мене мало радують речі, які раніше приносили задоволення." },
                { "id": 3, "text": "Я відчуваю сильну тривогу або напруження." },
                { "id": 4, "text": "Мені складно зупинити хвилюючі думки." },
                { "id": 5, "text": "Я відчуваю фізичну втому або виснаження без причини." },
                { "id": 6, "text": "Мій настрій легко погіршується через дрібниці." },
                { "id": 7, "text": "Я часто відчуваю стрес, який складно контролювати." },
                { "id": 8, "text": "Я маю труднощі зі сном через думки або стрес." },
                { "id": 9, "text": "Мені важко відчути спокій і розслабитися." },
                { "id": 10, "text": "Я відчуваю, що емоційно виснажений(а)." }
            ]
        },
        {
            "id": "identityLevel",
            "title": "Стан відносин із собою",
            "description": "Самооцінка, самосприйняття, критичність, мотивація.",
            "questions": [
                { "id": 11, "text": "Я часто критикую себе за помилки." },
                { "id": 12, "text": "Я відчуваю, що недостатньо хороший(а) у багатьох речах." },
                { "id": 13, "text": "Мені складно приймати компліменти." },
                { "id": 14, "text": "Я часто порівнюю себе з іншими не на свою користь." },
                { "id": 15, "text": "Я рідко відчуваю гордість за свої досягнення." },
                { "id": 16, "text": "Мені складно мотивувати себе щось робити." },
                { "id": 17, "text": "Я відчуваю, що часто не відповідаю власним очікуванням." }
            ]
        },
        {
            "id": "socialLevel",
            "title": "Соціальний стан",
            "description": "Відчуття підтримки, близькість, комунікація та взаємодія.",
            "questions": [
                { "id": 18, "text": "Я часто почуваюся самотнім(ньою), навіть серед людей." },
                { "id": 19, "text": "Мені здається, що мало хто мене по-справжньому розуміє." },
                { "id": 20, "text": "Мені важко відкриватися іншим емоційно." },
                { "id": 21, "text": "Я уникаю близьких стосунків через страх бути пораненим(ною)." },
                { "id": 22, "text": "Я рідко відчуваю підтримку від інших людей." },
                { "id": 23, "text": "Я часто уникаю конфліктів і не виражаю своїх потреб." },
                { "id": 24, "text": "Я відчуваю, що мої стосунки недостатньо глибокі." }
            ]
        },
        {
            "id": "functionLevel",
            "title": "Функціонування та життєвий баланс",
            "description": "Продуктивність, самоорганізація, баланс життя і відпочинку.",
            "questions": [
                { "id": 25, "text": "Я часто відкладаю важливі справи на потім." },
                { "id": 26, "text": "Мені важко концентруватися на завданнях." },
                { "id": 27, "text": "Я відчуваю, що погано керую своїм часом." },
                { "id": 28, "text": "Я часто відчуваю, що не маю контролю над своїм життям." },
                { "id": 29, "text": "Мої звички (сон, харчування, відпочинок) іноді виходять з балансу." },
                { "id": 30, "text": "Я часто витрачаю багато часу в телефоні/соцмережах без реальної користі." }
            ]
        }
    ]
}



export const TextDashboard = {
    Username: 'Користувач',
    Level: 'Рівень',
    Rating: 'в рейтингу',
    LeaderBoard: 'Лідерборд',
    Achievments: 'Досягнення',
    NextLvl: 'до наступного рівня',
    Text: [{ Title: 'Медитації', Paragraph: 'Практика спокою' }, { Title: 'АІ - чати', Paragraph: 'Обери свій тип' }, { Title: 'Статистика', Paragraph: 'Твій прогрес' }, { Title: 'Психологи', Paragraph: 'Знайти фахівця' }]
}


export const TextMedetation = {
    HeadMeds: 'Медитації',
    HeadMed: 'Медетація',
    Title: 'Знайди свій спокій',
    Paragraph: 'Практики, створені для твого комфорту',
    MedetationList: [
        {
            id: 1,
            Icon: '/ImageMed/im1.jpeg',
            Type: 'Ранок',
            Name: 'Ранкова медитація',
            Title: 'Почни день з позитивним налаштуванням',
            Time: 10
        },
        {
            id: 2,
            Icon: '/ImageMed/im2.jpeg',
            Type: 'Вечір',
            Name: 'Спокій перед сном',
            Title: 'Розслабся та підготуйся до здорового сну',
            Time: 15
        },
        {
            id: 3,
            Icon: '/ImageMed/im3.jpeg',
            Type: 'Експрес',
            Name: 'Дихальні вправи',
            Title: 'Швидка практика для зняття стресу',
            Time: 5
        },

    ]
}



export const AddsTextAiChats = {
    Name: 'Обери свого AI-помічника',
    Time: 'хв на відповідь',
    Join: 'Приєднатися зараз',
    Buy: 'Переглянути пропозиції',
    Title: 'Кожен чат налаштований під твої потреби',
    ChatList: [
        {
            Name: 'Звичайний',
            Title: 'Вільна розмова: користувач пише що завгодно, а бот підтримує, слухає, дає базові поради.',
            Subscription: true
        },
        {
            Name: 'Антитривожний',
            Title: 'Чат для зниження тривоги та стресу: дихальні вправи, техніки заземлення, підтримуючі слова.',
            Subscription: false
        },
        {
            Name: 'Антидепресивний',
            Title: 'Підтримка у стані апатії чи пригніченості: тепла розмова, мотивація, маленькі кроки вперед.',
            Subscription: false
        },
        {
            Name: 'Мотиваційний',
            Title: 'Фокус на цілях та продуктивності: поради як діяти, планувати, тримати мотивацію.',
            Subscription: false
        },
        {
            Name: 'Самооцінка',
            Title: 'Робота над впевненістю та позитивним ставленням до себе, розвиток внутрішньої сили.',
            Subscription: false
        },
        {
            Name: 'Стосунки',
            Title: 'Розмова про партнерські чи особисті стосунки, підтримка у конфліктах та емоціях.',
            Subscription: false
        },
    ]
}



export const StatasText = {
    Header: 'Статистика',
    Stats: ['Медитацій завершено', 'Середній настрій', 'Годин практики'],
    Mounth: 'за цей місяць',
    TitleMood: 'Настрій за тиждень',
    Week: ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Нд'],
    TitleSesions: 'Останні сесії',
    Session: [
        { Name: 'Ранкова медитація', Date: 'Сьогодні, 08:00', Time: '10 хв' },
        { Name: 'Дихальні вправи', Date: 'Вчора, 14:30', Time: '5 хв' },
        { Name: 'Спокій перед сном', Date: 'Вчора, 22:00', Time: '15 хв' },
    ]
}

export const AchivmentsText = {
    Header: 'Досягнення',
    Open: 'Виконано',
    Progres: 'Прогрес',
    Basic: '#Базовий',
    Rare: '#Рідкісний',
    Epic: '#Епічний',
    Legendary: '#Легендарний',
    Achivments: [
        {
            Title: 'Перший вхід',
            Xp: 20,
            Description: 'Вітаємо з першим входом до нашого додатку! Ви зробили перший крок на шляху до покращення свого психічного здоров\'я за допомогою AI-психолога. Продовжуйте досліджувати та використовувати всі можливості, які ми пропонуємо, щоб підтримати вас у вашій подорожі до благополуччя.',
            AchivTitle: 'Завершити вхід',
            Type: 'basic',
        },
        {
            Title: 'Перші кроки',
            Xp: 50,
            Description: 'Вітаємо з завершенням вашої першої медитації! Це важливий крок на шляху до покращення вашого психічного здоров\'я та благополуччя. Продовжуйте практикувати медитацію, щоб відчути більше спокою, зосередженості та гармонії у своєму житті.',
            AchivTitle: 'Завершити першу медитацію',
            Type: 'basic',
        },
        {
            Title: 'Тижневий марафон',
            Xp: 200,
            Description: 'Вітаємо з успішним завершенням тижневого марафону медитацій! Ваше віддане прагнення до покращення психічного здоров\'я є надихаючим. Продовжуйте підтримувати цю позитивну звичку, щоб відчути ще більше користі',
            AchivTitle: 'Медитувати 7 днів поспіль',
            Type: 'rare',
        },
        {
            Title: 'Майстер дисципліни',
            Xp: 500,
            Description: 'Вітаємо з досягненням неймовірного рубежу - 30 днів медитації поспіль! Ваша відданість та дисципліна є справжнім прикладом для наслідування. Продовжуйте цю позитивну звичку, щоб підтримувати своє психічне здоров\'я та благополуччя на високому рівні.',
            AchivTitle: 'Медитувати 30 днів поспіль',
            Type: 'epic',
        },
        {
            Title: 'Просвітлений',
            Xp: 1000,
            Description: 'Вітаємо з досягненням вражаючого рубежу - завершення 100 медитацій! Ваша відданість та наполегливість у практиці медитації є справжнім джерелом натхнення. Продовжуйте цю позитивну звичку, щоб підтримувати своє психічне здоров\'я та благополуччя на високому рівні.',
            AchivTitle: 'Завершити 100 медитацій',
            Type: 'legendary',
        },
        {
            Title: 'Перша розмова',
            Xp: 30,
            Description: 'Вітаємо з початком вашої першої розмови з AI-психологом! Це важливий крок на шляху до покращення вашого психічного здоров\'я та благополуччя. Продовжуйте використовувати цю можливість для отримання підтримки та порад від нашого AI-психолога.',
            AchivTitle: 'Почати чат з AI-психологом',
            Type: 'basic',
        },
        {
            Title: 'Душевна бесіда',
            Xp: 150,
            Description: 'Вітаємо з досягненням важливого рубежу - відправлення 50 повідомлень в чат з AI-психологом! Ваша активна участь у спілкуванні є ключем до покращення вашого психічного здоров\'я та благополуччя. Продовжуйте використовувати цю можливість для отримання підтримки та порад від нашого AI-психолога.',
            AchivTitle: 'Відправити 50 повідомлень',
            Type: 'rare',
        },
        {
            Title: 'Майстер спілкування',
            Xp: 750,
            Description: 'Вітаємо з досягненням вражаючого рубежу - відправлення 500 повідомлень в чат з AI-психологом! Ваша активна участь у спілкуванні є ключем до покращення вашого психічного здоров\'я та благополуччя. Продовжуйте використовувати цю можливість для отримання підтримки та порад від нашого AI-психолога.',
            AchivTitle: 'Відправити 500 повідомлень',
            Type: 'epic',
        },
        {
            Title: 'Особистість',
            Xp: 100,
            Description: 'Вітаємо з заповненням вашого профілю повністю! Це важливий крок на шляху до покращення вашого досвіду використання нашого додатку. Заповнення профілю допомагає нам краще розуміти ваші потреби та надавати більш персоналізовану підтримку для вашого психічного здоров\'я та благополуччя.',
            AchivTitle: 'Заповнити профіль повністю',
            Type: 'basic',
        },
        {
            Title: 'Досвідчений практик',
            Xp: 300,
            Description: 'Вітаємо з досягненням 10 рівня! Ваш прогрес є свідченням вашої відданості покращенню вашого психічного здоров\'я та благополуччя. Продовжуйте використовувати всі можливості, які ми пропонуємо, щоб підтримати вас у вашій подорожі до благополуччя.',
            AchivTitle: 'Досягнути 10 рівня',
            Type: 'rare',
        },
        {
            Title: 'Майстер медитації',
            Xp: 1500,
            Description: 'Вітаємо з досягненням 25 рівня! Ваш прогрес є свідченням вашої відданості покращенню вашого психічного здоров\'я та благополуччя. Продовжуйте використовувати всі можливості, які ми пропонуємо, щоб підтримати вас у вашій подорожі до благополуччя.',
            AchivTitle: 'Досягнути 25 рівня',
            Type: 'legendary',
        },
    ]
}


export const LeaderBoardText = {
    Header: 'Лідерборд',
    Username: 'Користувач',
    YouPosition: 'Твоя позиція',
    Level: 'Рівень',
    AddXp: 'Як заробити XP?',
    FirstXP: 'Завершуй медитації (+50 XP)',
    SecondXp: 'Спілкуйся в AI чаті (+5 XP за повідомлення)',
    ThridXp: 'Виконуй денні завдання (до +100 XP)',
    FourthXp: 'Відвідуй додаток щодня (+20 XP за день)',
}


export const SettingText = {

    NameBlock: 'Налаштування',
    NameBlockSafe: 'Безпека',
    Safe: 'Змінити пароль',
    SafeTitle: 'Оновіть свій пароль',

    OtherBlock: 'Інше',
    OtherName: 'Допомога та підтримка',
    OtherTitle: 'FAQ, контакти',

    Leave: 'Вийти з акаунту',
    Settings: [{
        Push: 'Сповіщення',
        PushTitle: 'Push-повідомлення та email',
        On: false,
        Type: 'Switch'
    },
    {
        Push: 'Тема додатку',
        PushTitle: 'Змінити тему додатку',
        On: false,
        Type: 'Switch'
    },
    {
        Push: 'Мова',
        Type: 'Arrow'
    }
    ],
}

export const MainLandPageText = {
    Title: 'MoonlorAI',
    Login: 'Увійти',
    Start: 'Почати безкоштовно ',
    TitleHeader: "Платформа ментального здоров'я",
    BigTitleOne: "Твій особистий ",
    BigTitleTwo: "психолог у смартфоні",
    Paragraph: "AI-підтримка 24/7, професійні психологи, медитації та унікальна система геймефікації на блокчейні. Все для твого ментального здоров'я.",
    List: {
        Safe: "Безпечно",
        Confidential: "Конфіденційно",
        Convenient: "Зручно"
    },
    Users: 'Користувачів',
    Psyhologist: 'Психологів',
    Medetation: 'Медитацій',
    Recomendaation: 'Рекомендацій',

    InfoList: [
        {
            Title: 'Медитації',
            Addition: 'та практики',
            Paragraph: 'Колекція керованих медитацій для різних потреб: від боротьби зі стресом до поліпшення сну',
            Smaller: 'Нова медитація щотижня',
        },
        {
            Title: 'AI-асистенти',
            Addition: 'консультанти',
            Paragraph: 'Отримуйте підтримку 24/7 від спеціалізованих AI-асистентів у різних сферах психологічної допомоги',
            Smaller: 'Необмежені чати у тарифі Pro',
        },
        {
            Title: 'Геймефікація',
            Addition: 'та нагороди',
            Paragraph: "Перетворіть турботу про ментальне здоров'я на захопливу подорож",
            Smaller: 'Через гру — до внутрішньої рівноваги',
        },
        {
            Title: 'Web3',
            Addition: 'інтеграція',
            Paragraph: "Перша платформа ментального здоров'я з підтвердженими досягненнями на блокчейні",
            Smaller: 'Підтримка Ethereum та Polygon',
        },
        {
            Title: 'Психологи',
            Addition: 'професіонали',
            Paragraph: "Маркетплейс верифікованих фахівців з різних напрямків психології",
            Smaller: 'Відео-консультація з конфіденційністю',
        },
    ],
    Turbota: 'Почніть турботу про себе вже сьогодні',
    Join: "Приєднуйтесь до тисяч користувачів, які вже покращили своє ментальне здоров'я з MindCare",
    Subs: "Без прив'язки карти • Скасувати можна будь-коли • Перші 7 днів безкоштовно",
    Prava: "© 2025 MoonlorAI. Всі права захищені.",
    Links: ['Політика', 'Умови', 'Контакти']

}